app/controllers/api/quizzes_controller.rb

SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."user_id" = $1  [["user_id", 8]]
---
  def index

    @user = current_user
    @page = params[:page] || 0

    @quizzes = nil
    user_id = params[:user_id]
    if (user_id)
      @quizzes = User.find(user_id).quizzes.joins(:user)
    else
      @quizzes = Quiz.joins(:user)
      @quizzes = @quizzes.where(edited: true);
    end


    @search_keywords = params[:search_keywords]

    if @search_keywords.presence
      @search_keywords = @search_keywords.split
      @quizzes = @quizzes.where("quizzes.name ~* ? OR users.name ~* ?", @search_keywords, @search_keywords);