app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if (@user.save)
---
INSERT INTO "users" ("name", "password_digest", "email", "session_token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "jordan"], ["password_digest", "$2a$10$pDctx6m.ke6KmEVpawX97OqFAmhKqmN4tUkA.tLfogx0wUyziDVDG"], ["email", "jordan@jordan.com"], ["session_token", "RadLrdzBKXjyf7Xy8G8xyQ"]]